# pandas exercise: answers

In [125]:
import pandas as pd

In this next few examples, we will use several lists and dicts.  These are created in the cell below.

In [126]:
number_list = [1,2,3,4,5]
letter_list = ['a','b','c','d','e'] 
alpha_list = ['alpha', 'beta', 'gamma', 'delta', 'epsilon']

## Create Series and DataFrames

Create a pandas Series from number_list.  Name it number_series.

In [127]:
# Write your code here
number_series = pd.Series(number_list)
number_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

Create a pandas Series from alpha_list. Name it alpha_series.

In [128]:
# Write your code here
alpha_series = pd.Series(alpha_list)
alpha_series

0      alpha
1       beta
2      gamma
3      delta
4    epsilon
dtype: object

Combine number_series and alpha_series into a DataFrame.  Name it df_first.  Name the columns of this DataFrame 'numbers' and 'alphas'.  
To do this, create a dict with the column names as keys and the Series as values and pass this as an argument to the DataFrame constructor.
Note that the merge is done on index values.

In [129]:
# Write your code here
dict_columns = {'numbers':number_series, 'alphas' :alpha_series}    
df_first = pd.DataFrame(dict_columns)
df_first

   numbers   alphas
0        1    alpha
1        2     beta
2        3    gamma
3        4    delta
4        5  epsilon

Change the index of number_series. Use letter_list to supply the values of the index.

In [130]:
# Write your code here
number_series.index = letter_list
number_series

a    1
b    2
c    3
d    4
e    5
dtype: int64

Combine number_series and alpha_series into a DataFrame again.
This  will stack the rows since index values are not the same.

In [131]:
# Write your code here
df_stacked = pd.DataFrame({'numbers':number_series, 'letters' :alpha_series})
df_stacked

   numbers  letters
a      1.0      NaN
b      2.0      NaN
c      3.0      NaN
d      4.0      NaN
e      5.0      NaN
0      NaN    alpha
1      NaN     beta
2      NaN    gamma
3      NaN    delta
4      NaN  epsilon

In the next examples, we use the patient_list and patient_dict structures defined below.

In [132]:
# patient_list is a list of dictionaries. Each dioctionary contains the details of a patient.
patient_list = [
    {'nhs_id': '123-456-7890', 'name': 'Fred Bloggs', 'age': 42},
    {'nhs_id': '234-567-8901', 'name': 'Jane Doe', 'age': 55},
    {'nhs_id': '345-678-9012', 'name': 'Florence N', 'age': 32},
    {'nhs_id': '456-789-0123', 'name': 'John Smith', 'age': 28},
    {'nhs_id': '567-890-1234', 'name': 'Emma Brown', 'age': 45},
    {'nhs_id': '678-901-2345', 'name': 'Charlie Black', 'age': 50},
    {'nhs_id': '789-012-3456', 'name': 'Daisy White', 'age': 28},
    {'nhs_id': '890-123-4567', 'name': 'George Green', 'age': 34},
    {'nhs_id': '901-234-5678', 'name': 'Hannah Blue', 'age': 41},
    {'nhs_id': '012-345-6789', 'name': 'Ivy Yellow', 'age': 38},
    {'nhs_id': '123-567-8901', 'name': 'Jack Purple', 'age': 47},
    {'nhs_id': '234-678-9012', 'name': 'Laura Orange', 'age': 53},
    {'nhs_id': '345-789-0123', 'name': 'Mason Gray', 'age': 28}
]

# patient_dict is a dictionary of lists. Each list contains values of a particular column. 
patient_dict = {
    'nhs_id': [
        '123-456-7890', '234-567-8901', '345-678-9012', '456-789-0123', 
        '567-890-1234', '678-901-2345', '789-012-3456', '890-123-4567', 
        '901-234-5678', '012-345-6789', '123-567-8901', '234-678-9012', 
        '345-789-0123'
    ],
    'name': [
        'Fred Bloggs', 'Jane Doe', 'Florence N', 'John Smith', 'Emma Brown', 
        'Charlie Black', 'Daisy White', 'George Green', 'Hannah Blue', 'Ivy Yellow', 
        'Jack Purple', 'Laura Orange', 'Mason Gray'
    ],
    'age': [
        42, 55, 32, 28, 45, 50, 28, 34, 41, 38, 47, 53, 28
    ]
}

Create a DataFrame from patient_list.  Name it df_patient.

In [133]:
# Write your code here
df_patient = pd.DataFrame(patient_list)
df_patient.head(2)

         nhs_id         name  age
0  123-456-7890  Fred Bloggs   42
1  234-567-8901     Jane Doe   55

Create a DataFrame from patient_dict.  Name it df_patient_alt.

In [134]:
# Write your code here
df_patient_alt = pd.DataFrame(patient_dict)
df_patient_alt.head(2)

         nhs_id         name  age
0  123-456-7890  Fred Bloggs   42
1  234-567-8901     Jane Doe   55

Use df_patient == df_patient_alt to confirm that the two datasets have the same set of values  
i.e., compare if the values in the rows are the same.

In [135]:
# Write your code here
df_patient == df_patient_alt

    nhs_id  name   age
0     True  True  True
1     True  True  True
2     True  True  True
3     True  True  True
4     True  True  True
5     True  True  True
6     True  True  True
7     True  True  True
8     True  True  True
9     True  True  True
10    True  True  True
11    True  True  True
12    True  True  True

View and analyse df_patient.  
Use DataFrame methods: head(), tail(), info(), describe().

In [136]:
# Write your code here
print("Analysing the df1 dataframe")
print("head\n", df_patient.head())
print("tail\n", df_patient.tail())

Analysing the df1 dataframe
head
          nhs_id         name  age
0  123-456-7890  Fred Bloggs   42
1  234-567-8901     Jane Doe   55
2  345-678-9012   Florence N   32
3  456-789-0123   John Smith   28
4  567-890-1234   Emma Brown   45
tail
           nhs_id          name  age
8   901-234-5678   Hannah Blue   41
9   012-345-6789    Ivy Yellow   38
10  123-567-8901   Jack Purple   47
11  234-678-9012  Laura Orange   53
12  345-789-0123    Mason Gray   28

In [137]:

print("info\n", df_patient.info())
print("describe\n", df_patient.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nhs_id  13 non-null     object
 1   name    13 non-null     object
 2   age     13 non-null     int64
dtypes: int64(1), object(2)
memory usage: 444.0+ bytes
info
 None
describe
              age
count  13.000000
mean   40.076923
std     9.613025
min    28.000000
25%    32.000000
50%    41.000000
75%    47.000000
max    55.000000

Set the nhs_id column as the index.  Use either:
* df_patient.index = ...
* df_patient.set_index(..., inplace=True)

In [138]:
# Write your code here
df_patient.set_index(df_patient['nhs_id'], inplace=True)
df_patient.head(2)

                    nhs_id         name  age
nhs_id
123-456-7890  123-456-7890  Fred Bloggs   42
234-567-8901  234-567-8901     Jane Doe   55

Now that the nhs_id values are the index, drop the nhs_id column.   Use the drop() method with argument inplace=True.

In [139]:
df_patient.drop(columns='nhs_id', inplace=True)
df_patient.head(2)

                     name  age
nhs_id
123-456-7890  Fred Bloggs   42
234-567-8901     Jane Doe   55

## Select rows and columns

Select the name column from df_patient as a Series.

In [140]:
# Write your code here
#df_patient['name']
df_patient.name

nhs_id
123-456-7890      Fred Bloggs
234-567-8901         Jane Doe
345-678-9012       Florence N
456-789-0123       John Smith
567-890-1234       Emma Brown
678-901-2345    Charlie Black
789-012-3456      Daisy White
890-123-4567     George Green
901-234-5678      Hannah Blue
012-345-6789       Ivy Yellow
123-567-8901      Jack Purple
234-678-9012     Laura Orange
345-789-0123       Mason Gray
Name: name, dtype: object

Select both the Name and Age columns from df_patient (as a DataFrame)

In [141]:
# Write your code here
#df_patient[['name', 'age']]
df_patient.loc[: ,['name', 'age']]

                       name  age
nhs_id
123-456-7890    Fred Bloggs   42
234-567-8901       Jane Doe   55
345-678-9012     Florence N   32
456-789-0123     John Smith   28
567-890-1234     Emma Brown   45
678-901-2345  Charlie Black   50
789-012-3456    Daisy White   28
890-123-4567   George Green   34
901-234-5678    Hannah Blue   41
012-345-6789     Ivy Yellow   38
123-567-8901    Jack Purple   47
234-678-9012   Laura Orange   53
345-789-0123     Mason Gray   28

Select the 2nd row using iloc[]

In [142]:
# Write your code here
df_patient.iloc[1]

name    Jane Doe
age           55
Name: 234-567-8901, dtype: object

Select the 2nd to the 5th row inclusive using iloc[]

In [143]:
# Write your code here
df_patient.iloc[1:5]

                    name  age
nhs_id
234-567-8901    Jane Doe   55
345-678-9012  Florence N   32
456-789-0123  John Smith   28
567-890-1234  Emma Brown   45

Select the row with the index '234-567-8901' using .loc[]

In [144]:
# Write your code here
df_patient.loc['234-567-8901']

name    Jane Doe
age           55
Name: 234-567-8901, dtype: object

Select the row with the indexes between '234-567-8901' and '567-890-1234' using loc[].  
Note that this returns rows inclusive of the first and last row.

In [145]:
# Write your code here
df_patient.loc['234-567-8901':'567-890-1234']

                    name  age
nhs_id
234-567-8901    Jane Doe   55
345-678-9012  Florence N   32
456-789-0123  John Smith   28
567-890-1234  Emma Brown   45

Select a subset of *both* rows and columns from df_patient
* the row with the indexes between '234-567-8901' and '567-890-1234' incusive
* the name and age columns  

Use loc[]

In [146]:
# Write your code here
df_patient.loc['234-567-8901':'567-890-1234', ['name', 'age']]

                    name  age
nhs_id
234-567-8901    Jane Doe   55
345-678-9012  Florence N   32
456-789-0123  John Smith   28
567-890-1234  Emma Brown   45

## Manipulate data in DataFrames

Add a new column, age_next_year

In [147]:
# Write your code here
df_patient['age_next_year'] = df_patient['age'] + 1   
df_patient.head(2)

                     name  age  age_next_year
nhs_id
123-456-7890  Fred Bloggs   42             43
234-567-8901     Jane Doe   55             56

Drop the column, age_next_year

In [148]:
# Write your code here
df_patient.drop(columns='age_next_year', inplace=True)
df_patient.head(2)

                     name  age
nhs_id
123-456-7890  Fred Bloggs   42
234-567-8901     Jane Doe   55

Create a filtered DataFrame that contains only those patients who are 40 years old or older.

In [149]:
# Write your code here
#df_patient['age'] >= 40
df_patient[df_patient['age'] >= 40]

                       name  age
nhs_id
123-456-7890    Fred Bloggs   42
234-567-8901       Jane Doe   55
567-890-1234     Emma Brown   45
678-901-2345  Charlie Black   50
901-234-5678    Hannah Blue   41
123-567-8901    Jack Purple   47
234-678-9012   Laura Orange   53

Sort the patient DataFrame by its index (nhs_id) values.

In [150]:
# Write your code here
df_patient.sort_index(ascending=True)

                       name  age
nhs_id
012-345-6789     Ivy Yellow   38
123-456-7890    Fred Bloggs   42
123-567-8901    Jack Purple   47
234-567-8901       Jane Doe   55
234-678-9012   Laura Orange   53
345-678-9012     Florence N   32
345-789-0123     Mason Gray   28
456-789-0123     John Smith   28
567-890-1234     Emma Brown   45
678-901-2345  Charlie Black   50
789-012-3456    Daisy White   28
890-123-4567   George Green   34
901-234-5678    Hannah Blue   41

Sort the patient DataFrame by values of the age column: from oldest to youngest.

In [151]:
# Write your code here
df_patient.sort_values(by='age', ascending=False)

                       name  age
nhs_id
234-567-8901       Jane Doe   55
234-678-9012   Laura Orange   53
678-901-2345  Charlie Black   50
123-567-8901    Jack Purple   47
567-890-1234     Emma Brown   45
123-456-7890    Fred Bloggs   42
901-234-5678    Hannah Blue   41
012-345-6789     Ivy Yellow   38
890-123-4567   George Green   34
345-678-9012     Florence N   32
456-789-0123     John Smith   28
789-012-3456    Daisy White   28
345-789-0123     Mason Gray   28

Sort the patient DataFrame by values of the age and name column: from oldest to youngest, then for patients of teh same age, in alphbetical order of name.

In [152]:
# Write your code here
df_patient.sort_values(by=['age', 'name'], ascending=[False, True])

                       name  age
nhs_id
234-567-8901       Jane Doe   55
234-678-9012   Laura Orange   53
678-901-2345  Charlie Black   50
123-567-8901    Jack Purple   47
567-890-1234     Emma Brown   45
123-456-7890    Fred Bloggs   42
901-234-5678    Hannah Blue   41
012-345-6789     Ivy Yellow   38
890-123-4567   George Green   34
345-678-9012     Florence N   32
789-012-3456    Daisy White   28
456-789-0123     John Smith   28
345-789-0123     Mason Gray   28

Handle missing data

In [ ]:
# Write your code here

Merge  (join) two DataFrames

In [ ]:
# Write your code here